docs/benchmark-results/sync-vs-async/raw/stage0-async-nobatch-k6-logs/insert-only-vu300.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/large-db-insert-async.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 10m30s max duration (incl. graceful stop):
              * insert_async: 34 iterations for each of 300 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=242\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=247\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=134\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=230\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=263\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=228\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=138\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=253\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=264\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=149\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=291\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=288\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=285\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=275\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=145\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=286\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=203\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=278\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=248\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=144\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=261\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=249\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=243\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=229\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=139\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=232\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=266\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=136\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=259\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=107\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=281\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=260\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=244\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=283\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=268\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=271\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=270\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=137\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=140\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=143\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=262\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=245\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=141\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=246\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=267\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=295\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=135\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=287\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=269\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=294\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=273\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=276\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=299\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=202\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=272\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=298\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=241\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=146\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=251\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=204\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=293\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=279\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=258\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=284\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=289\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=282\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=280\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=290\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=175\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=296\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=277\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=274\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=265\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=292\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-19T17:19:06+09:00" level=warning msg="Request Failed" error="Post \"http://localhost:8080/benchmark/coupon-issues/async?couponId=4&memberId=297\": dial tcp 127.0.0.1:8080: connectex: No connection could be made because the target machine actively refused it."


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=8.97ms  min=0s med=6.96ms max=96.98ms  p(90)=15.56ms p(95)=20.94ms
      { expected_response:true }...: avg=9.04ms  min=0s med=7ms    max=96.98ms  p(90)=15.56ms p(95)=21.08ms
    http_req_failed................: 0.73%  75 out of 10200
    http_reqs......................: 10200  23258.311597/s

    EXECUTION
    iteration_duration.............: avg=10.99ms min=0s med=7.34ms max=127.76ms p(90)=18.29ms p(95)=27.07ms
    iterations.....................: 10200  23258.311597/s

    NETWORK
    data_received..................: 739 kB 1.7 MB/s
    data_sent......................: 1.5 MB 3.3 MB/s



running (00m00.4s), 000/300 VUs, 10200 complete and 0 interrupted iterations
insert_async ✓ [ 100% ] 300 VUs  00m00.4s/10m0s  10200/10200 iters, 34 per VU